# var_1 = "Hello world"
# int- целочиленный тип данных,float - числа с плавающей точкой(вещественные), str(строки) - 'руслан'
var_1 = (str(8) + str(3))#целое численное
print(var_1)
name = "ruslan"
last_name = " doroshkov"
print(name + " 7")
print((name + " ") + "5")
# my_name = input("vvod ")
# print(len(my_name))
dozhd = "ruslan"
zontik = False

if not dozhd :
    if dozhd =="Да" :
        print('3 блок кода')
elif dozhd == 'нет' and dozhd == "ruslan":#иначе если
    print("нет")
else:
    print("иначе")
#<= - меньше или равно
#>= - меньше или равно
#!= - не равно
#булевы операторы - and , or ,not
#домашка : условная консрукция if else если переменная равна имени то привет на экран иначе вы не угадали
#если вторая переменная равна фамилии то доступ разрешен иначе доступ запрещен
#псевдокод :
если переменная(name) равна руслан
    вывод привет мир
    если второая переменная(last_name) равна фамилии
        вывести доступ разрешен
    иначе
        вывести доступ запрещен
иначе
    вывести вы не зарегистрированы




